{
    "name": "Daniel Tymecki",
    "version": "2024.06.05",
    "image": "profile.jpg",
    "contact": {
      "email": "Daniel.Tymecki@Gmail.com",
      "phone": "(954) 549-5039",
      "location": "Miami, FL",
      "linkedin": "https://www.linkedin.com/in/daniel-tymecki-799711127/"
    },
    "professional_summary": "Dynamic Full Stack Software Engineer with extensive expertise in web development, cloud architecture, and real-time event-driven systems. Proficient in Python, Angular, React, Node.js, and AWS, with a track record of delivering innovative solutions to complex challenges. Developed a reputation for combining technical prowess with a passion for problem-solving to drive transformative outcomes in high-pressure environments.",
    "work_experience": [
      {
        "company": "Millennium",
        "title": "Full Stack Software Engineer",
        "dates": "January 2023 - Present",
        "location": "Miami, FL",
        "responsibilities": [
          "Spearheaded the development of Millennium's cutting-edge portfolio management cloud-based tooling suite by orchestrating seamless collaboration with backend developers.",
          "Provided dedicated support to quantitative risk, senior management, and portfolio management teams, refining operational workflows and enhancing user experience.",
          "Innovated and crafted dynamic front-end applications crucial to millions of global users, leveraging Angular TS 16 and React to deliver intuitive user interfaces.",
          "Championed Agile methodologies, fostering a culture of continuous improvement and delivering high-quality software solutions on time and within budget."
        ]
      },
      {
        "company": "L3Harris",
        "title": "Sr. Associate Software Engineer Level II",
        "dates": "November 2021 - January 2023",
        "location": "Palm Bay, FL",
        "responsibilities": [
          "Promoted to lead an integrated product team of engineers to develop a cloud-based platform for autonomous antenna requisitioning to service missions from several clients.",
          "Advised a team of senior systems engineers on software practices and microservice-oriented systems design for a 200M software redesign effort.",
          "Architected and developed a configurable, multi-threaded, Python-based simulation engine microservice, winning a key business pursuit valued at over 500M."
        ]
      },
      {
        "company": "L3Harris",
        "title": "Associate Software Engineer Level I",
        "dates": "January 2020 - November 2021",
        "location": "Palm Bay, FL",
        "responsibilities": [
          "Hired as a full-stack engineer to aid in creating a cloud-based, mission integration distributed system.",
          "Collaborated with astrophysicists to develop faster-than-realtime C++ flight software for satellites.",
          "Developed a server-side caching system in Typescript that reduced user load times by 24%."
        ]
      }
    ],
    "education": [
      {
        "institution": "University of Florida, Herbert Wertheim College of Engineering",
        "location": "Gainesville, FL",
        "degree": "B.S.E Computer Science Engineering with a Minor in Entrepreneurship",
        "dates": "July 2016 - December 2019"
      }
    ],
    "projects": [
      {
            "title": "Resume Website",
            "description": [
                "Created a personal resume website using React and Typescript.",
                "Implemented responsive design for optimal viewing on all devices.",
                "Utilized CSS and themes to create a visually appealing design."
            ],
            "link": "",
            "githubLink": "https://github.com/greenphantom/resume"
      },
      {
        "title": "Project Automata",
        "description": [
          "Automata Script Manager is a tool for managing and running scripts with a user-friendly interface.",
          "Create New Scripts: Users can create new scripts with specified parameters, descriptions, and functions.",
          "Update Existing Scripts: Users can update the details and functions of existing scripts.",
          "View Scripts: Users can view a list of all scripts and select individual scripts to view or update.",
          "Run Scripts: Users can execute scripts directly from the application.",
          "Delete Scripts: Users can delete scripts from the database."
        ],
        "link": "",
        "githubLink": "https://github.com/greenphantom/Project-Automata"
      },
      {
        "title": "Study Buddy",
        "description": [
          "Developed an Android application to connect students looking for study partners at UF named Study Buddy.",
          "Features include real-time location services, group chat functionality, user profile customization, and sleek, materialistic design.",
          "Utilized Firebase for realtime user authentication."
        ],
        "link": "",
        "githubLink": "https://github.com/greenphantom/Study-Buddy"
      },
      {
        "title": "Ocaml Polynomial Simplifier",

        "description": [
          "Developed a polynomial simplifier in Ocaml as part of the Programming Languages course at UF.",
          "Utilized functional programming concepts such as recursion and pattern matching to simplify polynomials."
        ],
        "link": "",
        "githubLink": "https://github.com/greenphantom/Ocaml-Polynomial-Simplifier"
      }
    ],
    "skills": {
      "languages": ["Python", "C++", "Java", "C#", "Javascript", "Typescript", "HTML", "CSS", "Ocaml"],
      "databases": ["Postgres", "SQL", "MongoDB"],
      "frameworks": ["Flask/Falcon", "Angular", "React", "OpenAPI", "Node.js", "Kafka", "RabbitMQ"],
      "tooling": ["Linux", "Git", "Docker", "Kubernetes", "AWS", "Jenkins", "VS Code", "Atlassian Developer Suite"]
    }
  }